yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8af5268.h
/* ADC configuration register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ADON        : 1;
  unsigned char CONT        : 1;
  unsigned char             : 2;
  unsigned char SPSEL       : 3;
} __BITS_ADC_CR1;
#endif
__IO_REG8_BIT(ADC_CR1,     0x5401, __READ_WRITE, __BITS_ADC_CR1);

/* ADC configuration register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SCAN        : 1;
  unsigned char ALIGN       : 1;
  unsigned char             : 2;
  unsigned char EXTSEL      : 2;
  unsigned char EXTRIG      : 1;
} __BITS_ADC_CR2;
#endif
__IO_REG8_BIT(ADC_CR2,     0x5402, __READ_WRITE, __BITS_ADC_CR2);

/* ADC data register high */
__IO_REG8    (ADC_DRH,     0x5404, __READ_WRITE);
/* ADC data register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 6;
  unsigned char DATA        : 2;
} __BITS_ADC_DRL;
#endif
__IO_REG8_BIT(ADC_DRL,     0x5405, __READ_WRITE, __BITS_ADC_DRL);

/* ADC schmitt trigger disable register high */
__IO_REG8    (ADC_TDRH,    0x5406, __READ_WRITE);
/* ADC schmitt trigger disable register low */
__IO_REG8    (ADC_TDRL,    0x5407, __READ_WRITE);

/*-------------------------------------------------------------------------
 *      ADC bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define ADC_CSR_CH               ADC_CSR_bit.CH
#define ADC_CSR_AWDIE            ADC_CSR_bit.AWDIE
#define ADC_CSR_EOCIE            ADC_CSR_bit.EOCIE
#define ADC_CSR_AWD              ADC_CSR_bit.AWD
#define ADC_CSR_EOC              ADC_CSR_bit.EOC

#define ADC_CR1_ADON             ADC_CR1_bit.ADON
#define ADC_CR1_CONT             ADC_CR1_bit.CONT
#define ADC_CR1_SPSEL            ADC_CR1_bit.SPSEL

#define ADC_CR2_SCAN             ADC_CR2_bit.SCAN
#define ADC_CR2_ALIGN            ADC_CR2_bit.ALIGN
#define ADC_CR2_EXTSEL           ADC_CR2_bit.EXTSEL
#define ADC_CR2_EXTRIG           ADC_CR2_bit.EXTRIG

#define ADC_DRL_DATA             ADC_DRL_bit.DATA

#endif

/*-------------------------------------------------------------------------
 *      ADC bit masks
 *-----------------------------------------------------------------------*/
#define MASK_ADC_CSR_CH          0x0F
#define MASK_ADC_CSR_AWDIE       0x10
#define MASK_ADC_CSR_EOCIE       0x20
#define MASK_ADC_CSR_AWD         0x40
#define MASK_ADC_CSR_EOC         0x80

#define MASK_ADC_CR1_ADON        0x01
#define MASK_ADC_CR1_CONT        0x02
#define MASK_ADC_CR1_SPSEL       0x70

#define MASK_ADC_CR2_SCAN        0x01
#define MASK_ADC_CR2_ALIGN       0x02
#define MASK_ADC_CR2_EXTSEL      0x30
#define MASK_ADC_CR2_EXTRIG      0x40

#define MASK_ADC_DRL_DATA        0xC0


/*-------------------------------------------------------------------------
 *      CAN register definitions
 *-----------------------------------------------------------------------*/
/* CAN master control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char INRQ        : 1;
  unsigned char SLEEP       : 1;
  unsigned char TXFP        : 1;
  unsigned char RFLM        : 1;
  unsigned char NART        : 1;
  unsigned char AWUM        : 1;
  unsigned char ABOM        : 1;
  unsigned char TTCM        : 1;
} __BITS_CAN_MCR;
#endif
__IO_REG8_BIT(CAN_MCR,     0x5420, __READ_WRITE, __BITS_CAN_MCR);

/* CAN master status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char INAK        : 1;
  unsigned char SLAK        : 1;
  unsigned char ERRI        : 1;
  unsigned char WKUI        : 1;
  unsigned char TX          : 1;
  unsigned char RX          : 1;
} __BITS_CAN_MSR;
#endif
__IO_REG8_BIT(CAN_MSR,     0x5421, __READ_WRITE, __BITS_CAN_MSR);

/* CAN transmit status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RQCP0       : 1;
  unsigned char RQCP1       : 1;
  unsigned char RQCP2       : 1;
  unsigned char             : 1;
  unsigned char TXOK0       : 1;
  unsigned char TXOK1       : 1;
  unsigned char TXOK2       : 1;
} __BITS_CAN_TSR;
#endif
__IO_REG8_BIT(CAN_TSR,     0x5422, __READ_WRITE, __BITS_CAN_TSR);

/* CAN transmit priority register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CODE0       : 1;
  unsigned char CODE1       : 1;
  unsigned char TME0        : 1;
  unsigned char TME1        : 1;
  unsigned char TME2        : 1;
  unsigned char LOW0        : 1;
  unsigned char LOW1        : 1;
  unsigned char LOW2        : 1;
} __BITS_CAN_TPR;
#endif
__IO_REG8_BIT(CAN_TPR,     0x5423, __READ, __BITS_CAN_TPR);

/* CAN receive FIFO register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char FMP         : 2;
  unsigned char             : 1;
  unsigned char FULL        : 1;
  unsigned char FOVR        : 1;
  unsigned char RFOM        : 1;
} __BITS_CAN_RFR;
#endif
__IO_REG8_BIT(CAN_RFR,     0x5424, __READ_WRITE, __BITS_CAN_RFR);

/* CAN interrupt enable register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TMEIE       : 1;
  unsigned char FMPIE       : 1;
  unsigned char FFIE        : 1;
  unsigned char FOVIE       : 1;
  unsigned char             : 3;
  unsigned char WKUIE       : 1;
} __BITS_CAN_IER;
#endif
__IO_REG8_BIT(CAN_IER,     0x5425, __READ_WRITE, __BITS_CAN_IER);

/* CAN diagnosis register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LBKM        : 1;
  unsigned char SILM        : 1;
  unsigned char SAMP        : 1;
  unsigned char RX          : 1;
  unsigned char TXM2E       : 1;
} __BITS_CAN_DGR;
#endif
__IO_REG8_BIT(CAN_DGR,     0x5426, __READ_WRITE, __BITS_CAN_DGR);

/* CAN page selection register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PS          : 3;
} __BITS_CAN_PSR;
#endif
__IO_REG8_BIT(CAN_PSR,     0x5427, __READ_WRITE, __BITS_CAN_PSR);

/* CAN paged register 0 N/A */
__IO_REG8    (CAN_P0,      0x5428, __READ_WRITE);
/* CAN paged register 1 N/A */
__IO_REG8    (CAN_P1,      0x5429, __READ_WRITE);
/* CAN paged register 2 N/A */
__IO_REG8    (CAN_P2,      0x542A, __READ_WRITE);
/* CAN paged register 3 N/A */
__IO_REG8    (CAN_P3,      0x542B, __READ_WRITE);
/* CAN paged register 4 N/A */
__IO_REG8    (CAN_P4,      0x542C, __READ_WRITE);
/* CAN paged register 5 N/A */
__IO_REG8    (CAN_P5,      0x542D, __READ_WRITE);
/* CAN paged register 6 N/A */
__IO_REG8    (CAN_P6,      0x542E, __READ_WRITE);
/* CAN paged register 7 N/A */
__IO_REG8    (CAN_P7,      0x542F, __READ_WRITE);
/* CAN paged register 8 N/A */
__IO_REG8    (CAN_P8,      0x5430, __READ_WRITE);
/* CAN paged register 9 N/A */
__IO_REG8    (CAN_P9,      0x5431, __READ_WRITE);
/* CAN paged register A N/A */
__IO_REG8    (CAN_PA,      0x5432, __READ_WRITE);
/* CAN paged register B N/A */
__IO_REG8    (CAN_PB,      0x5433, __READ_WRITE);
/* CAN paged register C N/A */
__IO_REG8    (CAN_PC,      0x5434, __READ_WRITE);
/* CAN paged register D N/A */
__IO_REG8    (CAN_PD,      0x5435, __READ_WRITE);
/* CAN paged register E N/A */
__IO_REG8    (CAN_PE,      0x5436, __READ_WRITE);
/* CAN paged register F N/A */
__IO_REG8    (CAN_PF,      0x5437, __READ_WRITE);

/*-------------------------------------------------------------------------
 *      CAN bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

